// classes.cpp

#include "BasicDevice.h"

/**
 * @brief Выполняет метод foo_A класса A.
 * 
 * Этот метод выводит сообщение о том, что он был вызван.
 * Может быть использован для демонстрации работы класса A.
 */
void A::foo_A() {
    std::cout << "Method foo_A called" << std::endl;
}

/**
 * @brief Выполняет метод bar_A класса A.
 * 
 * Данный метод выводит сообщение о своем вызове.
 * Предназначен для тестирования или демонстрации функциональности класса A.
 */
void A::bar_A() {
    std::cout << "Method bar_A called" << std::endl;
}